## cloud_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 11 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.neo4j_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "neo4j_container_definition"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "NEO4J_dbms_memory_pagecache_size"
                          + value = "4G"
                        },
                      + {
                          + name  = "NEO4J_dbms.memory.heap.initial_size"
                          + value = "4G"
                        },
                      + {
                          + name  = "NEO4J_dbms_memory_heap_max__size"
                          + value = "4G"
                        },
                      + {
                          + name  = "NEO4J_ACCEPT_LICENSE_AGREEMENT"
                          + value = "yes"
                        },
                    ]
                  + essential        = true
                  + image            = "${NEO4J_IMAGE}"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${AWS_LOGS_GROUP}"
                          + awslogs-region        = "${AWS_LOGS_REGION}"
                          + awslogs-stream-prefix = "${AWS_LOGS_STREAM_PREFIX}"
                        }
                    }
                  + name             = "neo4j"
                  + portMappings     = [
                      + {
                          + ContainerPort = 7474
                          + Protocol      = "tcp"
                          + hostPort      = 7474
                        },
                      + {
                          + ContainerPort = 7473
                          + Protocol      = "tcp"
                          + hostPort      = 7473
                        },
                      + {
                          + ContainerPort = 7687
                          + Protocol      = "tcp"
                          + hostPort      = 7687
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "NEO4J_AUTH"
                          + valueFrom = "${NEO4J_AUTH}"
                        },
                    ]
                  + ulimits          = [
                      + {
                          + hardLimit = 400000
                          + name      = "nofile"
                          + softLimit = 400000
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "AWS_LOGS_GROUP"         = "/aws/ecs/neo4j"
          + "AWS_LOGS_REGION"        = "ca-central-1"
          + "AWS_LOGS_STREAM_PREFIX" = "neo4j-task"
          + "NEO4J_AUTH"             = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_auth"
          + "NEO4J_IMAGE"            = "neo4j:sha256:aabe1e6e19a8582d7fd9a42f7317b0e260e7870ce3e6b4dacffb2f7d6d141a31"
        }
    }

  # aws_cloudwatch_log_group.neo4j will be created
  + resource "aws_cloudwatch_log_group" "neo4j" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/neo4j"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
    }

  # aws_ecs_cluster.neo4j will be created
  + resource "aws_ecs_cluster" "neo4j" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "neo4j"
      + tags               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.neo4j will be created
  + resource "aws_ecs_service" "neo4j" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 600
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "neo4j"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "neo4j"
          + container_port   = 7474
          + target_group_arn = (known after apply)
        }
      + load_balancer {
          + container_name   = "neo4j"
          + container_port   = 7687
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0146ac8de4816d72c",
            ]
          + subnets          = [
              + "subnet-009019231e9e7b90c",
            ]
        }

      + service_registries {
          + registry_arn = (known after apply)
        }
    }

  # aws_ecs_task_definition.neo4j will be created
  + resource "aws_ecs_task_definition" "neo4j" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "2048"
      + execution_role_arn       = "arn:aws:iam::794722365809:role/cartography_container_execution_role"
      + family                   = "neo4j"
      + id                       = (known after apply)
      + memory                   = "8192"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + task_role_arn            = "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole"
    }

  # aws_lb.cartography will be created
  + resource "aws_lb" "cartography" {
      + arn                              = (known after apply)
      + arn_suffix                       = (known after apply)
      + dns_name                         = (known after apply)
      + enable_cross_zone_load_balancing = false
      + enable_deletion_protection       = true
      + id                               = (known after apply)
      + internal                         = false
      + ip_address_type                  = (known after apply)
      + load_balancer_type               = "network"
      + name                             = "cartography"
      + security_groups                  = (known after apply)
      + subnets                          = [
          + "subnet-089698b5a58022c12",
        ]
      + tags                             = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                         = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + vpc_id                           = (known after apply)
      + zone_id                          = (known after apply)

      + access_logs {
          + bucket  = "cbs-satellite-794722365809"
          + enabled = true
          + prefix  = "lb_logs"
        }

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.bolt will be created
  + resource "aws_lb_listener" "bolt" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 7687
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 7474
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.bolt will be created
  + resource "aws_lb_target_group" "bolt" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "bolt"
      + port                               = 7687
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "TCP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-00a43e63b345ba0ce"

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_lb_target_group.ecs will be created
  + resource "aws_lb_target_group" "ecs" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "ecs"
      + port                               = 7474
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "TCP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-00a43e63b345ba0ce"

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_service_discovery_private_dns_namespace.internal will be created
  + resource "aws_service_discovery_private_dns_namespace" "internal" {
      + arn         = (known after apply)
      + description = "internal domain for all services"
      + hosted_zone = (known after apply)
      + id          = (known after apply)
      + name        = "internal.local"
      + tags        = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + vpc         = "vpc-00a43e63b345ba0ce"
    }

  # aws_service_discovery_service.neo4j will be created
  + resource "aws_service_discovery_service" "neo4j" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "neo4j"
      + namespace_id  = (known after apply)
      + tags          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all      = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }

      + dns_config {
          + namespace_id   = (known after apply)
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 10
              + type = "A"
            }
        }

      + health_check_custom_config {
          + failure_threshold = 5
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
